public partial class MyMatrix
{
    //масив із власне елементами матриці
    private double[,] data;
    //Конструктори:

    //копіюючий з іншого примірника цього самого класу MyMatrix;
    public MyMatrix(MyMatrix other)
    {

    }
    //з двовимірного масиву типу double[,];
    public MyMatrix(double[,] array)
    {
        data = new double[array.GetLength(0), array.GetLength(1)];
        Array.Copy(array, data, array.Length);
    }
    //з «зубчастого» масиву double-ів, якщо він фактично прямокутний;
    public MyMatrix(double[][] jaggedArray)
    {

    }
    //з масиву рядків, якщо фактично ці рядки містять записані через пробіли та/або
    //числа, а кількість цих чисел у різних рядках однакова.
    public MyMatrix(string[] lines)
    {

    }
    //з рядка, що містить як пробіли та/або табуляції (їх трактувати як роздільники
    //чисел у одному рядку матриці), так і символи переведення рядка(їх трактувати
    //як роздільники рядків) — якщо фактичні дані того рядка утворюють прямокутну
    //числову матрицю; зокрема, щоб цим конструктором можна було створити
    //матрицю з рядка, раніше сформованого методом ToString(див.далі))
    public MyMatrix(string input)
    {

    }

    //----------------------------

    //Властивості (Properties) Height та Width, що дозволяють взнати (але не дозволяють
    //змінити) «висоту» (кількість рядків) та «ширину» (кількість стовпчиків)
    public int Height => data.GetLength(0);
    public int Width => data.GetLength(1);
    //Java-style getter-и (без setter-ів) кількості рядків getHeight() та кількості
    //стовпчиків getWidth()
    public int getHeight() => Height;
    public int getWidth() => Width;
    //Індексатори, що дозволяють публічно доступатися до будь-якого окремого елемента
    //матриці(як взнавати його значення, так і змінювати)
    //public double this[]
    //{

    //}
    //Java-style getter та setter для окремого елемента (getter має два параметри — номер
    //рядка і номер стовпчика, setter має три параметра — номер рядка, номер стовпчика, і
    //значення, яке записати у той рядок і стовпчик)
    public double GetElement;
    public double SetElement;
    //override public String ToString(), який формуватиме (табуляціями та
    //переведеннями рядка) зручне для сприйняття людиною прямокутне подання числової
    //матриці; метод повинен мати саме вищенаведений заголовок, бо саме так вдається
    //забезпечити, щоб примірники цього класу можна було виводити просто через
    //Console.WriteLine(A) (де A – примірник цього самого класу MyMatrix)
    public override string ToString()
    {

    }

}
